[
    {
      "bookId": "1",
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/gJ3BxcM/morgan-housel-a-Z-Mm-Sm-Acjg-unsplash.jpg",
      "review": "A timeless classic that delves into the decadence and disillusionment of the Jazz Age. Set against the backdrop of the roaring twenties, F. Scott Fitzgerald's masterpiece captures the essence of the era with its portrayal of wealth, love, and the American Dream. Through the enigmatic Jay Gatsby and his pursuit of the elusive Daisy Buchanan, Fitzgerald explores themes of ambition, obsession, and the emptiness of material success. With its rich prose and compelling characters, The Great Gatsby remains a poignant commentary on the pursuit of happiness and the emptiness of the hedonistic lifestyle.",
      "totalPages": 180,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classic", "Romance"],
      "publisher": "Scribner",
      "yearOfPublishing": 1925
    },
    {
      "bookId": "2",
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/Wk8Sd45/matt-ridley-H-LIL57-PHCc-unsplash.jpg",
      "review": "A powerful exploration of racial injustice and moral growth set in the American South. Harper Lee's To Kill a Mockingbird follows the story of Scout Finch, a young girl growing up in the racially-charged atmosphere of the 1930s. Through the eyes of Scout and her father, Atticus Finch, Lee paints a vivid picture of the deep-rooted prejudices and social inequalities of the time. The novel tackles complex issues such as racism, classism, and the loss of innocence with sensitivity and compassion. With its memorable characters and timeless themes, To Kill a Mockingbird continues to resonate with readers of all ages.",
      "totalPages": 281,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Classic", "Legal Drama"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": "3",
      "bookName": "1984",
      "author": "George Orwell",
      "image":"https://i.ibb.co/6smNsDz/thought-catalog-Q7s-Gp9-MSt-SY-unsplash.jpg",
      "review": "A dystopian masterpiece that explores themes of totalitarianism and surveillance. George Orwell's 1984 paints a chilling picture of a dystopian society ruled by a totalitarian regime. Through the eyes of protagonist Winston Smith, Orwell reveals the dangers of unchecked government control and the erosion of individual freedoms. The novel's themes of censorship, propaganda, and thought control are as relevant today as they were when it was first published. With its haunting depiction of a world gone wrong, 1984 remains a powerful warning against the dangers of authoritarianism and the importance of preserving freedom.",
      "totalPages": 328,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Dystopian", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": "4",
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image":"https://i.ibb.co/N9dZkqd/dan-gold-zv-Frn0-Ws7cw-unsplash.jpg",
      "review": "An iconic coming-of-age novel that captures the angst and alienation of adolescence. J.D. Salinger's The Catcher in the Rye follows the story of Holden Caulfield, a disillusioned teenager navigating the complexities of growing up in post-war America. Through Holden's cynical and often irreverent voice, Salinger explores themes of identity, belonging, and the search for authenticity. The novel's honest portrayal of teenage angst and rebellion has made it a beloved classic among readers of all generations. With its timeless themes and memorable protagonist, The Catcher in the Rye continues to resonate with readers around the world.",
      "totalPages": 224,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Coming-of-Age", "Literary"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": "5",
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/N9wtxZy/thought-catalog-B1d-QCWz0-U2w-unsplash.jpg",
      "review": "A delightful adventure tale set in Middle-earth, filled with magic and memorable characters. J.R.R. Tolkien's The Hobbit follows the journey of Bilbo Baggins, a reluctant hero who embarks on an epic quest to reclaim a lost treasure guarded by the fearsome dragon Smaug. Along the way, Bilbo encounters a host of fantastical creatures, including dwarves, elves, and trolls, as he traverses the enchanting landscapes of Middle-earth. With its rich mythology and captivating storytelling, The Hobbit is a timeless classic that continues to enchant readers of all ages.",
      "totalPages": 310,
      "rating": 4.7,
      "category": "Fantasy",
      "tags": ["Adventure", "High Fantasy"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
      "bookId": "6",
      "bookName": "The Da Vinci Code",
      "author": "Dan Brown",
      "image":"https://i.ibb.co/fHTx57y/zoe-1n-YWu8-s3d-E-unsplash.jpg",
      "review": "A gripping thriller that blends art, religion, and cryptography into an intriguing mystery. Dan Brown's The Da Vinci Code follows Harvard symbologist Robert Langdon as he is drawn into a complex web of clues and symbols that lead to a shocking secret hidden for centuries. With the help of cryptologist Sophie Neveu, Langdon must unravel the mysteries of the past to uncover the truth behind a conspiracy that could shake the foundations of Christianity. Combining historical fact with gripping fiction, The Da Vinci Code is a pulse-pounding thriller that keeps readers on the edge of their seats until the very end.",
      "totalPages": 454,
      "rating": 4.2,
      "category": "Thriller",
      "tags": ["Suspense", "Conspiracy"],
      "publisher": "Doubleday",
      "yearOfPublishing": 2003
    }
  ]
  